; domain
(define (domain zeno-travel)
(:requirements :typing :strips)
(:types transportable city flevel - object
        aircraft person - transportable)

(:predicates (at ?x - transportable ?c - city)
             (in ?a - aircraft ?p - person)
	     (fuel-level ?a - aircraft ?l - flevel)
	     (next ?l1 - flevel ?l2 - flevel))


(:action board
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (at ?a ?c)
                 (at ?b ?c))
 :effect (and (not (at ?a ?c))
              (in ?a ?b)))

(:action debark
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (in ?a ?b)
                 (at ?b ?c))
 :effect (and (not (in ?a ?b))
              (at ?a ?c)))

(:action fly
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d))
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?e)))

(:action zoom
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel ?f - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d)
		 (next ?f ?e)
		)
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?f)
	)
)

(:action refuel
 :parameters (?a - aircraft ?b - city ?c - flevel ?d - flevel)

 :precondition (and (fuel-level ?a ?c)
                 (next ?c ?d)
                 (at ?a ?b))
 :effect (and (fuel-level ?a ?d) (not (fuel-level ?a ?c))))


)

; problem
(define (problem ZTRAVEL-5-21)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	plane5 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	person13 - person
	person14 - person
	person15 - person
	person16 - person
	person17 - person
	person18 - person
	person19 - person
	person20 - person
	person21 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	city7 - city
	city8 - city
	city9 - city
	city10 - city
	city11 - city
	fl0 - flevel
	fl1 - flevel
	fl2 - flevel
	fl3 - flevel
	fl4 - flevel
	fl5 - flevel
	fl6 - flevel
	)
(:init
	(at plane1 city2)
	(fuel-level plane1 fl3)
	(at plane2 city0)
	(fuel-level plane2 fl1)
	(at plane3 city0)
	(fuel-level plane3 fl3)
	(at plane4 city9)
	(fuel-level plane4 fl0)
	(at plane5 city0)
	(fuel-level plane5 fl2)
	(at person1 city3)
	(at person2 city7)
	(at person3 city11)
	(at person4 city8)
	(at person5 city10)
	(at person6 city9)
	(at person7 city9)
	(at person8 city2)
	(at person9 city8)
	(at person10 city1)
	(at person11 city3)
	(at person12 city5)
	(at person13 city5)
	(at person14 city0)
	(at person15 city8)
	(at person16 city5)
	(at person17 city0)
	(at person18 city6)
	(at person19 city1)
	(at person20 city9)
	(at person21 city9)
	(next fl0 fl1)
	(next fl1 fl2)
	(next fl2 fl3)
	(next fl3 fl4)
	(next fl4 fl5)
	(next fl5 fl6)
)
(:goal (and
	(at person1 city0)
	(at person2 city1)
	(at person3 city5)
	(at person4 city2)
	(at person5 city1)
	(at person6 city11)
	(at person7 city4)
	(at person8 city10)
	(at person9 city2)
	(at person10 city8)
	(at person11 city11)
	(at person12 city6)
	(at person13 city6)
	(at person14 city2)
	(at person15 city0)
	(at person16 city10)
	(at person17 city8)
	(at person18 city10)
	(at person19 city6)
	(at person20 city8)
	(at person21 city11)
	))

)

; plan
1. (board person7 plane4 city9)
   deleted: (at person7 city9)
   added: (in person7 plane4)
   goals met: 0 of 21
2. (refuel plane4 city9 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 0 of 21
3. (board person6 plane4 city9)
   deleted: (at person6 city9)
   added: (in person6 plane4)
   goals met: 0 of 21
4. (board person21 plane4 city9)
   deleted: (at person21 city9)
   added: (in person21 plane4)
   goals met: 0 of 21
5. (board person20 plane4 city9)
   deleted: (at person20 city9)
   added: (in person20 plane4)
   goals met: 0 of 21
6. (board person17 plane2 city0)
   deleted: (at person17 city0)
   added: (in person17 plane2)
   goals met: 0 of 21
7. (fly plane2 city0 city8 fl1 fl0)
   deleted: (at plane2 city0) (fuel-level plane2 fl1)
   added: (at plane2 city8) (fuel-level plane2 fl0)
   goals met: 0 of 21
8. (board person14 plane3 city0)
   deleted: (at person14 city0)
   added: (in person14 plane3)
   goals met: 0 of 21
9. (zoom plane3 city0 city2 fl3 fl2 fl1)
   deleted: (at plane3 city0) (fuel-level plane3 fl3)
   added: (at plane3 city2) (fuel-level plane3 fl1)
   goals met: 0 of 21
10. (debark person14 plane3 city2)
   deleted: (in person14 plane3)
   added: (at person14 city2)
   goals met: 1 of 21
11. (board person9 plane2 city8)
   deleted: (at person9 city8)
   added: (in person9 plane2)
   goals met: 1 of 21
12. (refuel plane2 city8 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 1 of 21
13. (board person4 plane2 city8)
   deleted: (at person4 city8)
   added: (in person4 plane2)
   goals met: 1 of 21
14. (debark person17 plane2 city8)
   deleted: (in person17 plane2)
   added: (at person17 city8)
   goals met: 2 of 21
15. (fly plane2 city8 city2 fl1 fl0)
   deleted: (at plane2 city8) (fuel-level plane2 fl1)
   added: (at plane2 city2) (fuel-level plane2 fl0)
   goals met: 2 of 21
16. (debark person9 plane2 city2)
   deleted: (in person9 plane2)
   added: (at person9 city2)
   goals met: 3 of 21
17. (debark person4 plane2 city2)
   deleted: (in person4 plane2)
   added: (at person4 city2)
   goals met: 4 of 21
18. (zoom plane1 city2 city1 fl3 fl2 fl1)
   deleted: (at plane1 city2) (fuel-level plane1 fl3)
   added: (at plane1 city1) (fuel-level plane1 fl1)
   goals met: 4 of 21
19. (board person8 plane3 city2)
   deleted: (at person8 city2)
   added: (in person8 plane3)
   goals met: 4 of 21
20. (fly plane3 city2 city10 fl1 fl0)
   deleted: (at plane3 city2) (fuel-level plane3 fl1)
   added: (at plane3 city10) (fuel-level plane3 fl0)
   goals met: 4 of 21
21. (debark person8 plane3 city10)
   deleted: (in person8 plane3)
   added: (at person8 city10)
   goals met: 5 of 21
22. (board person5 plane3 city10)
   deleted: (at person5 city10)
   added: (in person5 plane3)
   goals met: 5 of 21
23. (refuel plane3 city10 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 5 of 21
24. (fly plane3 city10 city1 fl1 fl0)
   deleted: (at plane3 city10) (fuel-level plane3 fl1)
   added: (at plane3 city1) (fuel-level plane3 fl0)
   goals met: 5 of 21
25. (debark person5 plane3 city1)
   deleted: (in person5 plane3)
   added: (at person5 city1)
   goals met: 6 of 21
26. (board person19 plane1 city1)
   deleted: (at person19 city1)
   added: (in person19 plane1)
   goals met: 6 of 21
27. (board person10 plane1 city1)
   deleted: (at person10 city1)
   added: (in person10 plane1)
   goals met: 6 of 21
28. (fly plane4 city9 city11 fl1 fl0)
   deleted: (at plane4 city9) (fuel-level plane4 fl1)
   added: (at plane4 city11) (fuel-level plane4 fl0)
   goals met: 6 of 21
29. (refuel plane4 city11 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 6 of 21
30. (debark person6 plane4 city11)
   deleted: (in person6 plane4)
   added: (at person6 city11)
   goals met: 7 of 21
31. (board person3 plane4 city11)
   deleted: (at person3 city11)
   added: (in person3 plane4)
   goals met: 7 of 21
32. (debark person21 plane4 city11)
   deleted: (in person21 plane4)
   added: (at person21 city11)
   goals met: 8 of 21
33. (fly plane1 city1 city6 fl1 fl0)
   deleted: (at plane1 city1) (fuel-level plane1 fl1)
   added: (at plane1 city6) (fuel-level plane1 fl0)
   goals met: 8 of 21
34. (refuel plane1 city6 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 8 of 21
35. (debark person19 plane1 city6)
   deleted: (in person19 plane1)
   added: (at person19 city6)
   goals met: 9 of 21
36. (board person18 plane1 city6)
   deleted: (at person18 city6)
   added: (in person18 plane1)
   goals met: 9 of 21
37. (fly plane1 city6 city10 fl1 fl0)
   deleted: (at plane1 city6) (fuel-level plane1 fl1)
   added: (at plane1 city10) (fuel-level plane1 fl0)
   goals met: 9 of 21
38. (refuel plane1 city10 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 9 of 21
39. (debark person18 plane1 city10)
   deleted: (in person18 plane1)
   added: (at person18 city10)
   goals met: 10 of 21
40. (fly plane1 city10 city8 fl1 fl0)
   deleted: (at plane1 city10) (fuel-level plane1 fl1)
   added: (at plane1 city8) (fuel-level plane1 fl0)
   goals met: 10 of 21
41. (board person15 plane1 city8)
   deleted: (at person15 city8)
   added: (in person15 plane1)
   goals met: 10 of 21
42. (refuel plane1 city8 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 10 of 21
43. (debark person10 plane1 city8)
   deleted: (in person10 plane1)
   added: (at person10 city8)
   goals met: 11 of 21
44. (fly plane1 city8 city0 fl1 fl0)
   deleted: (at plane1 city8) (fuel-level plane1 fl1)
   added: (at plane1 city0) (fuel-level plane1 fl0)
   goals met: 11 of 21
45. (debark person15 plane1 city0)
   deleted: (in person15 plane1)
   added: (at person15 city0)
   goals met: 12 of 21
46. (fly plane4 city11 city4 fl1 fl0)
   deleted: (at plane4 city11) (fuel-level plane4 fl1)
   added: (at plane4 city4) (fuel-level plane4 fl0)
   goals met: 12 of 21
47. (refuel plane4 city4 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 12 of 21
48. (debark person7 plane4 city4)
   deleted: (in person7 plane4)
   added: (at person7 city4)
   goals met: 13 of 21
49. (fly plane4 city4 city5 fl1 fl0)
   deleted: (at plane4 city4) (fuel-level plane4 fl1)
   added: (at plane4 city5) (fuel-level plane4 fl0)
   goals met: 13 of 21
50. (refuel plane4 city5 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 13 of 21
51. (debark person3 plane4 city5)
   deleted: (in person3 plane4)
   added: (at person3 city5)
   goals met: 14 of 21
52. (board person16 plane4 city5)
   deleted: (at person16 city5)
   added: (in person16 plane4)
   goals met: 14 of 21
53. (board person13 plane4 city5)
   deleted: (at person13 city5)
   added: (in person13 plane4)
   goals met: 14 of 21
54. (board person12 plane4 city5)
   deleted: (at person12 city5)
   added: (in person12 plane4)
   goals met: 14 of 21
55. (fly plane4 city5 city6 fl1 fl0)
   deleted: (at plane4 city5) (fuel-level plane4 fl1)
   added: (at plane4 city6) (fuel-level plane4 fl0)
   goals met: 14 of 21
56. (refuel plane4 city6 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 14 of 21
57. (debark person13 plane4 city6)
   deleted: (in person13 plane4)
   added: (at person13 city6)
   goals met: 15 of 21
58. (debark person12 plane4 city6)
   deleted: (in person12 plane4)
   added: (at person12 city6)
   goals met: 16 of 21
59. (fly plane4 city6 city10 fl1 fl0)
   deleted: (at plane4 city6) (fuel-level plane4 fl1)
   added: (at plane4 city10) (fuel-level plane4 fl0)
   goals met: 16 of 21
60. (refuel plane4 city10 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 16 of 21
61. (debark person16 plane4 city10)
   deleted: (in person16 plane4)
   added: (at person16 city10)
   goals met: 17 of 21
62. (fly plane4 city10 city8 fl1 fl0)
   deleted: (at plane4 city10) (fuel-level plane4 fl1)
   added: (at plane4 city8) (fuel-level plane4 fl0)
   goals met: 17 of 21
63. (debark person20 plane4 city8)
   deleted: (in person20 plane4)
   added: (at person20 city8)
   goals met: 18 of 21
64. (zoom plane5 city0 city3 fl2 fl1 fl0)
   deleted: (at plane5 city0) (fuel-level plane5 fl2)
   added: (at plane5 city3) (fuel-level plane5 fl0)
   goals met: 18 of 21
65. (board person11 plane5 city3)
   deleted: (at person11 city3)
   added: (in person11 plane5)
   goals met: 18 of 21
66. (refuel plane5 city3 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 18 of 21
67. (board person1 plane5 city3)
   deleted: (at person1 city3)
   added: (in person1 plane5)
   goals met: 18 of 21
68. (fly plane5 city3 city0 fl1 fl0)
   deleted: (at plane5 city3) (fuel-level plane5 fl1)
   added: (at plane5 city0) (fuel-level plane5 fl0)
   goals met: 18 of 21
69. (refuel plane5 city0 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 18 of 21
70. (debark person1 plane5 city0)
   deleted: (in person1 plane5)
   added: (at person1 city0)
   goals met: 19 of 21
71. (fly plane5 city0 city11 fl1 fl0)
   deleted: (at plane5 city0) (fuel-level plane5 fl1)
   added: (at plane5 city11) (fuel-level plane5 fl0)
   goals met: 19 of 21
72. (refuel plane5 city11 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 19 of 21
73. (debark person11 plane5 city11)
   deleted: (in person11 plane5)
   added: (at person11 city11)
   goals met: 20 of 21
74. (fly plane5 city11 city7 fl1 fl0)
   deleted: (at plane5 city11) (fuel-level plane5 fl1)
   added: (at plane5 city7) (fuel-level plane5 fl0)
   goals met: 20 of 21
75. (board person2 plane5 city7)
   deleted: (at person2 city7)
   added: (in person2 plane5)
   goals met: 20 of 21
76. (refuel plane5 city7 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 20 of 21
77. (fly plane5 city7 city1 fl1 fl0)
   deleted: (at plane5 city7) (fuel-level plane5 fl1)
   added: (at plane5 city1) (fuel-level plane5 fl0)
   goals met: 20 of 21
78. (debark person2 plane5 city1)
   deleted: (in person2 plane5)
   added: (at person2 city1)
   goals met: 21 of 21
